In [14]:
#Julia Gajtkowska - Zadanie 4
# import potrzebnych bibliotek
import pandas as pd
import numpy as np

# stworzenie dataframe'u
d = {'name': ['Adam', 'Franek', 'Marysia', 'Natalia', 'Michał'], 'surname': ['Nowak', 'Kaczyński', 'Pełka', 'Gardna', 'Polak'], 'age': [18, 21, 19, 25, 23], 'sex': ['male', 'male', 'female', 'female', 'male']}
df = pd.DataFrame(data=d)

# wyświetleenie informacji na temat tabeli 
df.info(verbose=True)
# pokazuje ile mamy kolumn i danych, dodatkowo podaje informacje jakiego typu 
# są dane w kolumnach i ile zajmują pamięci

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     5 non-null      object
 1   surname  5 non-null      object
 2   age      5 non-null      int64
 3   sex      5 non-null      object
dtypes: int64(1), object(3)
memory usage: 288.0+ bytes

In [15]:
df.describe()
# podaje ilość kolumn różnych od null, średnią, maksimum i minimum z podanych danych 
# odchylenie standardowe danych,

             age
count   5.000000
mean   21.200000
std     2.863564
min    18.000000
25%    19.000000
50%    21.000000
75%    23.000000
max    25.000000

In [16]:
df.head(3)
# wyświetla n = 3 pierwszych wierszy z danych

      name    surname  age     sex
0     Adam      Nowak   18    male
1   Franek  Kaczyński   21    male
2  Marysia      Pełka   19  female